# GetDBServerId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPipeFittingAndAccessoryPressureDropUIServer..::..GetDBServerId Method
IPipeFittingAndAccessoryPressureDropUIServer Interface See Also
---
Returns the Id of the corresponding DB server for which this server provides an optional UI.
**Namespace:** Autodesk.Revit.UI.Plumbing**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
Guid GetDBServerId()
```

Visual Basic
---
```text
Function GetDBServerId As Guid
```

Visual C++
---
```text
Guid GetDBServerId()
```

# ### Return Value
The Id of the DB server.
# Remarks
Note that there may be only one UI server assigned to a DB calculation server.
# See Also
IPipeFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Plumbing Namespace